local function run (msg , matches)
if matches[1]:lower() == "الاوامر" or matches[1] == 'help' and is_sudo and owner and admin(msg) then
if not lang then
text = [[
`￤∴     اهــلا بك عــزيزي  `
`👁‍🗨~ ~ ~ ~ ~ ~ ~ ~ ~ ~👁‍🗨`
 
`♦️┇ م1 》 لعــرض قائمــﮭﮧ القفل + الفتح `

`♦️┇ م2 》 لعــرض قائمــﮭﮧ الرفع + التنزيل`

`♦️┇ م3 》 لعــرض قائمــﮭﮧ الحضر + الطرد `

`♦️┇ م4 》 لعــرض قائمــﮭﮧ المطورين `


`♦️┇ م5 》 لعــرض الاوام الخدميــﮭﮧ `

`👁‍🗨~ ~ ~ ~ ~ ~ ~ ~ ~ ~👁‍🗨`

🔱 ~ <b>NEKOL V2</b> ~ 🔱

]]

elseif lang then

text = [[
`￤∴     اهــلا بك عــزيزي  `
`👁‍🗨~ ~ ~ ~ ~ ~ ~ ~ ~ ~👁‍🗨`
 
`♦️┇ م1 》 لعــرض قائمــﮭﮧ القفل + الفتح `

`♦️┇ م2 》 لعــرض قائمــﮭﮧ الرفع + التنزيل`

`♦️┇ م3 》 لعــرض قائمــﮭﮧ الحضر + الطرد `

`♦️┇ م4 》 لعــرض قائمــﮭﮧ المطورين `


`♦️┇ م5 》 لعــرض الاوام الخدميــﮭﮧ `

`👁‍🗨~ ~ ~ ~ ~ ~ ~ ~ ~ ~👁‍🗨`
]]
end
return text
end
-----------------------------------------
if matches[1] == 'م1' and is_mod(msg) then
if not lang then
lock = [[
`
⚙ اوامــر (القفل+ الفتح) :

📌┊قفل + فتح : [ التثبيت ]

📇┊قفل + فتح : [ الكلايش ]

♻┊قفل + فتح : [ التكرار ]

📲┊قفل + فتح : [ الجهات ]

🔧┊قفل + فتح : [ الكل ]

🖲┊قفل + فتح : [ التاك ]

💾┊قفل + فتح : [ الاضافه ]

💳┊قفل + فتح : [ الروابط ]

👾┊قفل + فتح : [ البوتات ]

📹┊قفل + فتح : [ الفيديو ]

🎎┊قفل + فتح : [ الملصقات ]

📷┊قفل + فتح : [ الصور ]

🔄┊قفل + فتح : [ التوجيه ]

📝┊قفل + فتح : [ التعديل ]

🎤┊قفل + فتح : [ الصوت ]

💬┊قفل+ فتح : [ الدردشه ]

💻┊قفل+ فتح : [ المتحركه ]

📂┊قفل+ فتح : [ الملفات ]

🎶┊قفل+ فتح : [ الاغاني ]

📮┊قفل+ فتح : [ المواقع ]

📯┊قفل+ فتح : [ الاشعارات ]

🎊┊قفل+ فتح : [ الماركداون ]


🔹 ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ 🔹

🔱 ~ <b>NEKOL V2</b> ~ 🔱

🎙 | بل توفيق للجميع
`
 MSG BY :]]..msg.from.first_name

elseif lang then

lock = "Group name:"..msg.to.title..[[
⚙ اوامــر (القفل+ الفتح) :

📌┊قفل + فتح : [ التثبيت ]

📇┊قفل + فتح : [ الكلايش ]

♻┊قفل + فتح : [ التكرار ]

📲┊قفل + فتح : [ الجهات ]

🔧┊قفل + فتح : [ الكل ]

🖲┊قفل + فتح : [ التاك ]

💾┊قفل + فتح : [ الاضافه ]

💳┊قفل + فتح : [ الروابط ]

👾┊قفل + فتح : [ البوتات ]

📹┊قفل + فتح : [ الفيديو ]

🎎┊قفل + فتح : [ الملصقات ]

📷┊قفل + فتح : [ الصور ]

🔄┊قفل + فتح : [ التوجيه ]

📝┊قفل + فتح : [ التعديل ]

🎤┊قفل + فتح : [ الصوت ]

💬┊قفل+ فتح : [ الدردشه ]

💻┊قفل+ فتح : [ المتحركه ]

📂┊قفل+ فتح : [ الملفات ]

🎶┊قفل+ فتح : [ الاغاني ]

📮┊قفل+ فتح : [ المواقع ]

📯┊قفل+ فتح : [ الاشعارات ]

🎊┊قفل+ فتح : [ الماركداون ]


🔹 ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ 🔹

🔱 ~ <b>NEKOL V2</b> ~ 🔱

🎙 | بل توفيق للجميع
 MSG BY :]]..msg.from.first_name
end
return lock
end
-----------------------------------------
if matches[1] == 'م2' and is_mod(msg) then
if not lang then
lock2 = [[
`🕵‍♀اوامــر الحــظر والطــرد :

ّ🚸• • • • • • • • • • •ٴ🚸

🎐 = {الحظــر↓} :

🎐 = حظر 

🎐 = الغاء حظر 

🎐 = المحظورين 📄

🎐 = مسح المحظورين 📝

🚸• • • • • • • • • • •ٴ🚸

￤= لطــرد العــضو الامر ⇹ طرد 


📱 = العام 🏆

👁‍🗨 = حظر عام ☄

🌀 = الغاء العام ⚡️

🌐 = قائمه العام ♨

💠 = مسح قائمه العام ☒

🚸• • • • • • • • • • •ٴ🚸

￤<قائمــﮭه المنــع❔🗯>

￤= <منع🚸>

￤= <الغاء منع⚠️>

￤= <مسح قائمه المنع📝>

🚸• • • • • • • • • • •ٴ🚸

┇<قائمــﮭه المكتومين> 

┇= <كتم🔇✔️>

┇= <الغاء الكتم🗯🔹>

┇= <المكتومين🔕📄>

┇= <مسح المكتومين🔊📝>

🚸• • • • • • • • • • •ٴ🚸`

🔱 ~ <b>NEKOL V2</b> ~ 🔱

🔸➖➖➖➖➖➖➖➖➖🔸


 MSG BY :]]..msg.from.first_name

elseif lang then

lock2 = "Group name:"..msg.to.title..[[
`🕵‍♀اوامــر الحــظر والطــرد :

ّ🚸• • • • • • • • • • •ٴ🚸

🎐 = {الحظــر↓} :

🎐 = حظر 

🎐 = الغاء حظر 

🎐 = المحظورين 📄

🎐 = مسح المحظورين 📝

🚸• • • • • • • • • • •ٴ🚸

￤= لطــرد العــضو الامر ⇹ طرد 


📱 = العام 🏆

👁‍🗨 = حظر عام ☄

🌀 = الغاء العام ⚡️

🌐 = قائمه العام ♨

💠 = مسح قائمه العام ☒

🚸• • • • • • • • • • •ٴ🚸

￤<قائمــﮭه المنــع❔🗯>

￤= <منع🚸>

￤= <الغاء منع⚠️>

￤= <مسح قائمه المنع📝>

🚸• • • • • • • • • • •ٴ🚸

┇<قائمــﮭه المكتومين> 

┇= <كتم🔇✔️>

┇= <الغاء الكتم🗯🔹>

┇= <المكتومين🔕📄>

┇= <مسح المكتومين🔊📝>

🚸• • • • • • • • • • •ٴ🚸`

🔱 ~ <b>NEKOL V2</b> ~ 🔱

🔸➖➖➖➖➖➖➖➖➖🔸

 MSG BY :]]..msg.from.first_name
end
return lock2
end
-----------------------------------------
if matches[1]:lower() == "h2" or matches[1] == 'م3' and is_mod(msg) then
if not lang then
lock2 = [[
`⚙ اهلا بك في اوامر (الادمنــيه) :

￤تثبيت ⇹ [بالرد] : 

￤الغاء التثبيت ⇹ [بالرد] : 

￤[ضع صوره] : 

￤[حذف صوره]:`

  〘      💠اوامــر اخرئ      〙

ُ`⛤• • • • • • • • • • •⛤`

`￤ضع اسم : [النص]

￤ضع رابط : [ثم ارسل الرابط]

￤ضع ترحيب : [النص]

￤ضع قوانين : [النص] 

￤ضع وصف : [النص]`

  〘      💠اوامــر اخرئ     〙 

ُ`⛤• • • • • • • • • • •⛤`

`✡￤امسح الامر  : [ ادناه ⇓ ]`

`￤[ المحضورين ] \ [ المكتومين]`

`￤[ قائمه العام ] \ [ قائمه المنع]`

`￤[ المدراء ]  \ [ الوصف ]`

`￤[ القوانين] \ [ الترحيب]`

 〘      💠اوامــر اخرئ      〙

ُ`⛤• • • • • • • • • • •⛤`

`🃏￤الترحيب: [تفعيل ⇹ تعطيل]
🗑￤المحظورين : 
🔇￤ المكتومين : 
🎗￤ قائمه المنع : 
🎎￤الادمنيه : 
🎎￤المدراء : 
🎐￤الوصف : 
🌀￤القوانين : 
🎡￤الترحيب : 
🏞￤ضع ترحيب[ النص] :`

`🔹 ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ 🔹`

🔱 ~ <b>NEKOL V2</b> ~ 🔱

`🎙 | بل توفيق للجميع`

 MSG BY :]]..msg.from.first_name

elseif lang then

lock2 = [[

`⚙ اهلا بك في اوامر (الادمنــيه) :

￤تثبيت ⇹ [بالرد] : 

￤الغاء التثبيت ⇹ [بالرد] : 

￤[ضع صوره] : 

￤[حذف صوره]:`

`  〘      💠اوامــر اخرئ      〙`

ُ`⛤• • • • • • • • • • •⛤`

`￤ضع اسم : [النص]

￤ضع رابط : [ثم ارسل الرابط]

￤ضع ترحيب : [النص]

￤ضع قوانين : [النص] 

￤ضع وصف : [النص]`

`  〘      💠اوامــر اخرئ      〙`

ُ`⛤• • • • • • • • • • •⛤`

`✡￤امسح الامر  : [ ادناه ⇓ ]`

`￤[ المحضورين ]  <\>[ المكتومين]`

`￤[ قائمه العام ] <\>[ قائمه المنع]`

`￤[ المدراء ]  <\>  [ الوصف ]`

`￤[ القوانين] <\>  [ الترحيب]`

`  〘      💠اوامــر اخرئ      〙`

ُ`⛤• • • • • • • • • • •⛤`

`🃏￤الترحيب: [تفعيل ⇹ تعطيل]
🗑￤المحظورين : 
🔇￤ المكتومين : 
🎗￤ قائمه المنع : 
🎎￤الادمنيه : 
🎎￤المدراء : 
🎐￤الوصف : 
🌀￤القوانين : 
🎡￤الترحيب : 
🏞￤ضع ترحيب[ النص] :`

`🔹 ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ 🔹`

`🎙 | بل توفيق للجميع`

 MSG BY :]]..msg.from.first_name
end
return lock2
end
-----------------------------------------
if matches[1]:lower() == "h2" or matches[1] == 'م4' and is_mod(msg) then
if not lang then
lock2 = [[

`⚙ اهلا بك في اوامر (المطور) :

📮￤[تفعيل ⇹ لتفعيل المجموعــﮭﮧ]

📮￤[تعطيل⇹ لتعطيل المجموعــﮭﮧ]

💠￤رفع مدير ⇹ لرفع مدير

💠￤تنزيل مدير ⇹ لتنزيل مدير 

💠￤رفع ادمن ⇹  لرفع ادمن

💠￤تنزيل ادمن ⇹ لتنزيل ادمن

💡￤رفع مطور بالرد ⇹ لاضافه مطور

💡￤رفع مطور بالرد ⇹ لتنزيل مطور

📨￤اذاعه + الكلام : [℡]

📧￤رساله + ايدي المجوعه : [℡]

🔇￤مغادر ⇹ لمغادره البوت 

🚀￤المغادره تلقائيا ⇹ تفعيل : 

🚀￤المغادره تلقائيا ⇹ تعطيل : 

🗑￤تنظيف مسح + العدد للــ 100 فقط : 

📑￤المجموعات - لعرض مجموعات البوت`

`🔹 ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ 🔹`

🔱 ~ <b>NEKOL V2</b> ~ 🔱

`🎙 | بل توفيق للجميع`

MSG BY :]]..msg.from.first_name

elseif lang then

lock2 = "Group name:"..msg.to.title..[[

text = [[
 `⚙ اهلا بك في اوامر (المطور) :

📮￤[تفعيل ⇹ لتفعيل المجموعــﮭﮧ]

📮￤[تعطيل⇹ لتعطيل المجموعــﮭﮧ]

💠￤رفع مدير ⇹ لرفع مدير

💠￤تنزيل مدير ⇹ لتنزيل مدير 

💠￤رفع ادمن ⇹  لرفع ادمن

💠￤تنزيل ادمن ⇹ لتنزيل ادمن

💡￤رفع مطور بالرد ⇹ لاضافه مطور

💡￤رفع مطور بالرد ⇹ لتنزيل مطور

📨￤اذاعه + الكلام : [℡]

📧￤رساله + ايدي المجوعه : [℡]

🔇￤مغادر ⇹ لمغادره البوت 

🚀￤المغادره تلقائيا ⇹ تفعيل : 

🚀￤المغادره تلقائيا ⇹ تعطيل : 

🗑￤تنظيف مسح + العدد للــ 100 فقط : 

📑￤المجموعات - لعرض مجموعات البوت`

`🔹 ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ 🔹`

`🎙 | بل توفيق للجميع`
 MSG BY :]]..msg.from.first_name
end
return lock2
end
if matches[1] == "المطور" or matches[1] == "مطور" or matches[1] == "نيكول" or matches[1] == "اريد بوت" and is_mod(msg) then
    local text = [[


`⚪┋اهلا بك عزيزي في معلومات السورس ⬇`


▪️[NOVARV2<\> رابط السورس](https://github.com/NOVAR1/NOVARV1)

▪️[ᗫËᏉ ┋ＮᎧᏉÂℜ 👁‍🗨](https://telegram.me/N0VAR )

▪️[ᗫËᏉ ┋ͲÂⴼÂ  👁‍🗨](https://telegram.me/TAHAJ20 )

▪️[ͲËÂⱮ ‏ＮᎧᏉÂℜ](https://telegram.me/DEV_NOVAR )

▪️[Ꮏ Ꭼ Ꭿ Ꮇ Ꮪ Ꮏ Ꮻ Ꭱ Ꮇ 📯](https://telegram.me/TEAMSTORM )

▪️[NOVAR / تواصل](https://telegram.me/KM11Qbot )

▪️[TAHA \ تواصل](https://telegram.me/TAHAJ20_BOT)

▪️[oكروب دعم السورس](https://t.me/joinchat/EyLZJUM-zymXZ-4Mxy-Y9w) 

`💠 • • • • • • • • • • 💠`

`🔱 ~ <b>NEKOL V2</b> ~ 🔱`

`🎙 | بل توفيق للجميع`

]]
    return text
  end
  if matches[1] == "السورس" or matches[1] == "الاصدار" or matches[1] == "سورس" or matches[1] == "يا سورس" or matches[1] == "اريد سورس" and is_mod(msg) then
    local text = [[


`⚪┋اهلا بك عزيزي في معلومات السورس ⬇`


▪️[NOVARV2<\> رابط السورس](https://github.com/NOVAR1/NOVARV1)

▪️[ᗫËᏉ ┋ＮᎧᏉÂℜ 👁‍🗨](https://telegram.me/N0VAR )

▪️[ᗫËᏉ ┋ͲÂⴼÂ  👁‍🗨](https://telegram.me/TAHAJ20 )

▪️[ͲËÂⱮ ‏ＮᎧᏉÂℜ](https://telegram.me/DEV_NOVAR )

▪️[Ꮏ Ꭼ Ꭿ Ꮇ Ꮪ Ꮏ Ꮻ Ꭱ Ꮇ 📯](https://telegram.me/TEAMSTORM )

▪️[NOVAR / تواصل](https://telegram.me/KM11Qbot )

▪️[TAHA \ تواصل](https://telegram.me/TAHAJ20_BOT)

▪️[oكروب دعم السورس](https://t.me/joinchat/EyLZJUM-zymXZ-4Mxy-Y9w) 

`💠 • • • • • • • • • • 💠`

`🔱 ~ <b>NEKOL V2</b> ~ 🔱`

`🎙 | بل توفيق للجميع`

]]
    return text
  end
end


return {
patterns ={
"^([Hh]elp)$",
"^([Hh]1)$",
"^([Hh]2)$",
"^([Hh]3)$",
"^([Hh]4)$",
"^(الاوامر)$",
"^(م1)$",
"^(م2)$",
"^(م3)$",
"^(م4)$",
"^(المطور)$",
 "^(مطور)$",
 "^(اريد بوت)$",
"^(نيكول)$",
"^(المطورين)$",
"^(السورس)$",
 "^(الاصدار)$",
 "^(سورس)$",
"^(يا سورس)$",
"^(اريد سورس)$",
}, 
run =run
}
